Repository: Rusutikaa/docs
Catalog: OmegaT_tmx/OmegaT_tmx_FoundationLibraryRef/FoundationLibraryReference-level2.tmx
Source language: en_us
Languages: ja

source: The cloned scriptable objects typically correspond to objects in the application, but aren’t required to.
ja: 複製されたスクリプト対応オブジェクトは、概してアプリケーションの中の様々なオブジェクトに相当します、しかし必要とはされません。

source: The closure is called again repeatedly with the previous call’s return value and each element of the sequence.
ja: クロージャは、前の呼び出しの戻り値とシーケンスの各要素とともに繰り返して再び呼び出されます。

source: The closure is called again repeatedly with the updated accumulating value and each element of the sequence.
ja: クロージャは、更新された蓄積値とシーケンスの各要素とともに繰り返して再び呼び出されます。

source: The closure is called along with an array of Coding Key instances representing the sequence of keys needed to reach the value being decoded.
ja: クロージャは、デコードされる値に手を届かせるために必要とされるキーからなるシーケンスを表しているCoding Keyインスタンスからなる配列とともに呼び出されます。

source: The closure is called along with an array of Coding Key instances representing the sequence of keys needed to reach the value being encoded.
ja: クロージャは、エンコードされる値に手を届かせるために必要とされるキーからなるシーケンスを表しているCoding Keyインスタンスからなる配列とともに呼び出されます。

source: The closure to invoke for each region of data.
ja: データの各領域に対して発動するクロージャ。

source: The cluster’s two public classes, NSCharacter Set and NSMutable Character Set, declare the programmatic interface for static and dynamic character sets, respectively.
ja: このクラスタのもつ２つのパブリックなクラス、NSCharacter SetとNSMutable Character Setは、それぞれ静的および動的な文字セットに対するプログラムインターフェイスを宣言します。

source: The cluster’s two public classes, NSAttributed String and NSMutable Attributed String, declare the programmatic interface for read-only attributed strings and modifiable attributed strings, respectively.
ja: クラスタのもつ２つのパブリッククラス、NSAttributed StringとNSMutable Attributed Stringは、それぞれ読出し専用属性付文字列と修正可属性付文字列に対するプログラムインターフェイスを宣言します。

source: The coder encoding the receiver.
ja: レシーバをエンコードするコーダ。

source: The collection being appended to allocates any additional necessary storage to hold the new elements.
ja: コレクションは追加されることによって、新しい要素を保有するために何らかの追加的に必要なストレージを割り当てます。

source: The collection must not be empty.
ja: コレクションは空であってはなりません。

source: The combination of accessibility traits that best characterize the accessibility element.
ja: 最もよくアクセシビリティ要素を特徴づける、アクセシビリティ特徴いくつかの組み合わせ。

source: The command may optionally specify a location to save in and how to handle modified documents (by automatically saving changes, not saving them, or asking the user).
ja: この命令は、そこに保存するために随意にある場所をそしてどのように修正された書類を取り扱うか（自動的に変更を保存する、それらを保存しない、またはユーザに尋ねることによって）を指定します。

source: The common calendar in Europe, the Western Hemisphere, and elsewhere.
ja: ヨーロッパ、西半球、およびどこか他の地域で一般的なカレンダー。

source: The comparison function is used to compare two elements at a time and should return NSOrdered Ascending if the first element is smaller than the second, NSOrdered Descending if the first element is larger than the second, and NSOrdered Same if the elements are equal.
ja: 比較関数は、２つの要素を一度に比較するために使われます、そして最初の要素が２番目よりも小さいならばNSOrdered Ascendingを、最初の要素が２番目よりも大きいならばNSOrdered Descendingを、およびそれらの要素が同等ならばNSOrdered Sameを返さなければなりません。

source: The component to calculate.
ja: 計算する構成要素。

source: The components to search for.
ja: これらの構成要素を捜すことになります。

source: The computed hash value for the calendar.
ja: カレンダーに対する計算ハッシュ値。

source: The computed hash value for the date interval.
ja: 日付間隔に対する計算ハッシュ値。

source: The computed hash value for the decimal.
ja: 10進数に対する計算ハッシュ値。

source: The computed hash value for the index path.
ja: インデックスパスに対する計算ハッシュ値。

source: The computed hash value for the index set.
ja: インデックス集合に対する計算ハッシュ値。

source: The computed hash value for the transform.
ja: 変換に対する計算ハッシュ値。

source: The computed hash value of the date.
ja: 日付の計算ハッシュ値。

source: The conditions themselves are arbitrary: you define them as needed for your application.
ja: 条件それら自体は随意です：あなたはそれらをあなたのアプリケーションにとって必要なように定義します。

source: The constants specify the replacement behavior in replace Item(at: with Item At: backup Item Name: options: resulting Item URL:).
ja: replace Item(at: with Item At: backup Item Name: options: resulting Item URL:)において置換挙動を指定する定数。

source: The container identifiers for your app must be declared in the com .apple .developer .ubiquity-container-identifiers array of the .entitlements property list file in your Xcode project.
ja: あなたのアプリに対するコンテナ識別子は、あなたのXcodeプロジェクトの中の.entitlementsプロパティリストファイルのcom .apple .developer .ubiquity-container-identifiers配列において宣言されなければなりません。

source: The contents of data are copied.
ja: dataの内容はコピーされます。

source: The contents of files are not compared; matching of regular files is based on file modification dates.
ja: ファイルの内容は比較されません；それら通常ファイルの一致は、ファイル修正日に基づきます。

source: The contents of the descriptor, as a Boolean value, or false if an error occurs.
ja: 記述子の内容、ブール値として、またはエラーから起こるならばfalse。

source: The contents of the descriptor, as a string, or nil if an error occurs.
ja: この記述子のコメント、文字列として、またはエラーが起こるならばnil。

source: The contents of the descriptor, as a type, or 0 if an error occurs.
ja: 記述子の内容、ある型として、またはエラーが起こるならば０。

source: The contents of the descriptor, as an enumeration type, or 0 if an error occurs.
ja: 記述子の内容、列挙型として、またはエラーが起こるならば０。

source: The contents of the descriptor, as an integer value, or 0 if an error occurs.
ja: 記述子の内容、整数値として、またはエラーが起こるならば０。

source: The contents of the file wrapper as an opaque collection of data.
ja: ファイルラッパーの内容、データの不透明コレクションとして。

source: The contents of the file-system node associated with a regular-file file wrapper.
ja: 通常ファイルファイルラッパーと結び付けられるファイルシステムノードの内容。

source: The contents of the receiver as a Boolean value, coercing (to type Boolean) if necessary.
ja: ブール値としてのレシーバの内容、必要ならば（type Booleanに）強制します。

source: The contents of the receiver as a Unicode text string, coercing to type Unicode Text if necessary.
ja: レシーバの内容をユニコードテキスト文字列として、必要ならばtype Unicode Textに強制します。

source: The contents of the receiver as a type, coercing to type Type if necessary.
ja: レシーバの内容をある型として、必要ならばtype Typeに強制します。

source: The contents of the receiver as an enumeration type, coercing to type Enumerated if necessary.
ja: レシーバの内容を列挙型として、必要ならばtype Enumeratedへと強制します。

source: The contents of the receiver as an integer, coercing (to type SInt32) if necessary.
ja: レシーバの内容を整数として、必要ならば（type SInt32へと）強制します。

source: The context in which the current script command is executed.
ja: そこにおいて現在のスクリプトコマンドが執行されるところの前後関係。

source: The cookie is ignored if the receiver’s cookie accept policy is NSHTTPCookie Accept Policy Never.
ja: クッキーは、レシーバの持つクッキー受入方針がNSHTTPCookie Accept Policy Neverならば無視されます。

source: The cookie replaces an existing cookie with the same name, domain, and path, if one exists in the cookie storage.
ja: このクッキーは、同じ名前、ドメイン、そしてパスを持つある既存のクッキーに取って代わります、もしそれがクッキーストレージに存在するならば。

source: The cookie storage’s cookie accept policy.
ja: クッキーストレージの持つクッキー受入方針。

source: The cookie storage’s cookies, sorted according to sort Order, as an array of HTTPCookie objects.
ja: HTTPCookieオブジェクトからなる配列であるsort Orderによってソート（選別）される、クッキーストレージの持つクッキー。

source: The cookie storage’s cookies.
ja: クッキーストレージの持つクッキーそれら。

source: The cookie to delete.
ja: 削除されるクッキー。

source: The cookie to store.
ja: 格納されるクッキー。

source: The cookie will be ignored if the receiver's cookie accept policy is NSHTTPCookie Accept Policy Never.
ja: クッキーは、レシーバの持つクッキー受入方針がNSHTTPCookie Accept Policy Neverならば無視されます。

source: The cookie will be sent with requests for this path in the cookie's domain, and all paths that have this prefix.
ja: クッキーは、クッキーの持つドメインにおいてこのパス、そしてこの接頭辞を持つ全てのパスに対して要請とともに送られます。

source: The cookies from which the header fields are created.
ja: それからヘッダフィールドが作成されるクッキー。

source: The cookies to add.
ja: このクッキーを加えます。

source: The cookies will replace existing cookies with the same name, domain, and path, if one exists in the cookie storage.
ja: これらクッキーは、同じ名前、ドメイン、そしてパスを持つ既存のクッキーそれらに取って代わるでしょう、もしそれがクッキーストレージに存在するならば。

source: The copied object or objects.
ja: コピーされたオブジェクトまたは複数のオブジェクト。

source: The corresponding value for this key is an NSNumber object containing a Boolean value.
ja: このキーに対応する値は、NSNumberオブジェクトでブール値を含んでいます。

source: The corresponding value is a NSNumber object containing a Boolean value.
ja: 対応する値は、NSNumberオブジェクトでブール値を含んでいます。

source: The corresponding value is an NSDate object.
ja: 対応する値は、NSDateオブジェクトです。

source: The corresponding value is an NSNumber object containing a Boolean value.
ja: 対応する値は、NSNumberオブジェクトでブール値を含んでいます。

source: The corresponding value is an NSNumber object containing an OSType (unsigned 32-bit integer).
ja: 対応する値は、NSNumberオブジェクトでOSType（符号なし32ビット整数）を含んでいます。

source: The corresponding value is an NSNumber object containing an unsigned long long.
ja: 対応する値は、NSNumberオブジェクトでunsigned long longを含んでいます。

source: The corresponding value is an NSNumber object containing an unsigned long.
ja: 対応する値は、NSNumberオブジェクトでunsigned longを含んでいます。

source: The corresponding value is an NSNumber object that specifies the amount of free space on the file system in bytes.
ja: 対応する値は、NSNumberオブジェクトで、ファイルシステム上の空き容量をバイトで指定します。

source: The corresponding value is an NSNumber object that specifies the filesystem number of the file system.
ja: 対応する値は、NSNumberオブジェクトで、ファイルシステムの中のファイルシステム数を指定します。

source: The corresponding value is an NSNumber object that specifies the number of free nodes in the file system.
ja: 対応する値は、NSNumberオブジェクトで、ファイルシステムの中のフリーノード数を指定します。

source: The corresponding value is an NSNumber object that specifies the number of nodes in the file system.
ja: 対応する値は、NSNumberオブジェクトで、ファイルシステムの中のノード数を指定します。

source: The corresponding value is an NSNumber object that specifies the size of the file system in bytes.
ja: 対応する値は、NSNumberオブジェクトで、ファイルシステムのサイズをバイトで指定します。

source: The corresponding value is an NSNumber object.
ja: 対応する値は、NSNumberオブジェクトです。

source: The corresponding value is an NSString object (see NSFileType Attribute Values for possible values).
ja: 対応する値は、NSStringオブジェクトです（NSFileType Attribute Valuesを可能な値として見てください）。

source: The corresponding value is an NSString object.
ja: 対応する値は、NSStringオブジェクトです。

source: The corresponding value is an NSString value.
ja: 対応する値は、NSString値です。

source: The current directory path is the starting point for any relative paths you specify.
ja: 現在のディレクトリパスは、あなたが指定するあらゆる相対パスに対する出発点です。

source: The current state of the matching progress.
ja: マッチングの進捗の現在の状態。

source: The current thread must then dequeue and process the message when it has an opportunity to do so.
ja: そうでなければその実行はキューに加えられ実行ループによって次の機会に実行されます。

source: The current transformation is stored in the current graphics context and is applied to subsequent drawing operations.
ja: 現在の変換は、現在のグラフィックコンテキストにおいて格納されます、そして続いて起こる描画処理に適用されます。

source: The data available through the receiver up to a maximum of length bytes, or the maximum size that can be represented by an NSData object, whichever is the smaller.
ja: 最大限lengthバイト、またはNSDataオブジェクトによって表現可能な最大限サイズ、どちらかより小さい方に至るまでレシーバを通して利用可能なデータ。

source: The data available through the receiver up to maximum size that can be represented by an NSData object or, if a communications channel, until an end-of-file indicator is returned.
ja: レシーバを通して利用可能な、NSDataオブジェクトによって表現できる最大サイズまでまたは、通信経路ならば、ファイル終端指示子が返されるまでのデータ。

source: The data currently available in the receiver.
ja: レシーバにおいて現在利用可能なデータ。

source: The data currently available through the receiver, up to the the maximum size that can be represented by an NSData object.
ja: レシーバを通して現在利用可能な、NSDataオブジェクトによって表現できる最大サイズまでのデータ。

source: The data object from which to read.
ja: このデータオブジェクトから読み出すことになります。

source: The data to be searched for.
ja: 検索対象のデータ。

source: The data to be set in the initialized descriptor.
ja: 初期化される記述子の中に設定されるデータ。

source: The data to be written.
ja: 書き出されるデータ。

source: The data to cache.
ja: キャッシュするデータ。

source: The data, as a sequence of bytes, to be set in the returned descriptor.
ja: 返される記述子の中に設定されるデータ、バイトシーケンスとして。

source: The date at which to begin the search.
ja: そこで検索を開始することになる日付。

source: The date at which to start the search.
ja: そこで検索を開始するところの日付。

source: The date calculated from the current components using the stored calendar.
ja: 現在の構成要素から格納カレンダーを使って計算される日付。

source: The date components of the specified date.
ja: 指定された日付の日付構成要素。

source: The date contained in the weekend.
ja: 週末に含まれる日付。

source: The date format string used by the receiver.
ja: レシーバによって使われる日付書式設定文字列。

source: The date representation includes the day.
ja: 日付表現は、日を含みます。

source: The date representation includes the hour, minute, and second.
ja: 日付表現は、時、分、そして秒を含みます。

source: The date representation includes the timezone.
ja: 日付表現は、タイムゾーンを含みます。

source: The date representation includes the week of the year.
ja: 日付表現は、年内週番号を含みます。

source: The date representation includes the year, month, and day.
ja: 日付表現は、年、月、そして日を含みます。

source: The date representation includes the year.
ja: 日付表現は、年を含みます。

source: The date representation uses a space ( ) instead of T between the date and time.
ja: 日付表現は、空白（ ）をTの代わりに日付と時刻の間で使います。

source: The date representation uses the colon separator (:) in the time zone.
ja: 日付表現は、コロン区切り（:）をタイムゾーンにおいて使います。

source: The date representation uses the colon separator (:) in the time.
ja: 日付表現は、コロン区切り（:）を時刻において使います。

source: The date representation uses the dash separator (-) in the date.
ja: 日付表現は、ダッシュ区切り（-）を日付において使います。

source: The date style of the receiver.
ja: レシーバの日付スタイル。

source: The date to format.
ja: 書式設定する日付。

source: The date to search.
ja: 検索する日付。

source: The date to start calculation with.
ja: 計算を開始することになる日付。

source: The date to use.
ja: 使用する日付。

source: The date with which to compare the receiver.
ja: レシーバと比較する日付。

source: The debugger’s print-object command invokes this method to produce a textual description of an object.
ja: デバッガの持つ「オブジェクト出力」コマンドは、このメソッドを発動することで、あるオブジェクトのテキスト記述を生成します。

source: The decimal that contains the largest possible non-infinite magnitude for the underlying representation.
ja: 基底表現に対する最も大きい可能な非無限大の規模を含む10進数。

source: The decimal that contains the smallest possible non-infinite magnitude for the underlying representation.
ja: 基底表現に対する最も小さい可能な非無限大の規模を含む10進数。

source: The decimal value that represents the smallest possible non-zero value for the underlying representation.
ja: 基底表現に対する最も小さい可能な非ゼロの値を含む10進数。

source: The decimal value that represents the smallest possible normal magnitude for the underlying representation.
ja: 基底表現に対する最も小さい可能な正規化数の規模を含む10進数。

source: The decimal value to represent.
ja: 表すことになる10進法値。

source: The decoder used to decode the receiver.
ja: レシーバをデコードするために使われるデコーダ。

source: The deepest descendant of the accessibility hierarchy that has the focus.
ja: フォーカスを持つ、アクセシビリティ階層の最も深い子孫。

source: The default File Manager object for the file system.
ja: ファイルシステムに対する省略時のFile Managerオブジェクト。

source: The default attributes to use for the returned attributed string.
ja: 返される属性付き文字列のために使われる初期状態の属性。

source: The default behavior is to remove the item.
ja: 省略時の挙動は、項目の除去です。

source: The default calendar to use when formatting date components.
ja: 日付構成要素を書式設定するときに使う省略時のカレンダー。

source: The default cookie accept policy is always.
ja: 省略時のクッキー受入方針は、alwaysです。

source: The default date for the receiver.
ja: レシーバに対する省略時の日付。

source: The default formatting behavior for instances of the class.
ja: クラスのインスタンスに対する省略時の書式設定挙動。

source: The default formatting behavior.
ja: 省略時の書式設定挙動。

source: The default implementation allocates a new file wrapper, initializes it with init(regular File With Contents:), set its preferred Filename property, adds it to the directory with add File Wrapper(_:), and returns what add File Wrapper(_:) returned.
ja: 省略時の実装は、新しいファイルラッパーをアロケートします、それをinit(regular File With Contents:)で初期化します、それのpreferred Filenameプロパティを設定します、それをディレクトリにadd File Wrapper(_:)を使って加えます、そしてadd File Wrapper(_:)が返した何かを返します。

source: The default implementation of this method attempts to avoid unnecessary I/O by writing hard links to regular files instead of actually writing out their contents when the contents have not changed.
ja: このメソッドの省略時の実装は、内容が変更されなかった時に実際にそれらの内容をすっかり書き出してしまうのではなく、ハードリンクを通常ファイルに書き出すことによって不必要なI/Oを回避しようと試みます。

source: The default implementation of this method copies scripting objects by sending copy With Zone: to the object or objects specified by value.
ja: このメソッドの省略時の実装は、valueによって指定されるオブジェクトまたは複数のオブジェクトにcopy With Zone:を送ることによってスクリプティングオブジェクトをコピーします。

source: The default implementation of this method creates new scripting objects by sending alloc to a class and init to the resulting object.
ja: このメソッドの省略時の実装は、allocをあるクラスに送ってinitをその結果のオブジェクトに送ることによって新しいスクリプティングオブジェクトを作成します。

source: The default implementation of this method invokes string(for:).
ja: このメソッドの省略時の実装は、string(for:)を発動します。

source: The default implementation of this method raises an exception.
ja: このメソッドの省略時の実装は例外を引き起こします。

source: The default implementation provided for many of these methods by NSObject is appropriate for objects that implement a single comparison method whose selector, signature, and description match the following:
ja: NSObjectによってこれらのメソッドの多くに対して提供される省略時実装は、単一の比較メソッドでそれのもつセレクタ、シグネチャ、そして説明が以下に合うものを実装するオブジェクトに適切です。

source: The default implementation returns nil to indicate that the NSDimension class should not be used directly.
ja: 省略時の実装は、nilを返すことによって、NSDimensionクラスが直接に使われるべきでないことを指し示します。

source: The default implementation returns nil to indicate that the formatter object does not provide an attributed string.
ja: 省略時の実装は、nilを返して、フォーマッタオブジェクトが属性付き文字列を提供しないことを指し示します。

source: The default is 0.
ja: 省略時には0です。

source: The default is nil.
ja: 省略時にはnilです。

source: The default is "0".
ja: 省略時は"0"です。

source: The default is "FALSE", unless this cookie is version 1 or greater and a value for NSHTTPCookie Maximum Age is not specified, in which case it is assumed to be "TRUE".
ja: 省略時は"FALSE"です、このクッキーがバージョン 1 より大きくそしてNSHTTPCookie Maximum Ageの値が指定されない場合を除いて、その場合にはそれは"TRUE"を仮定されます。

source: The default is 0 .0.
ja: 省略時は、0 .0です。

source: The default setting is file, which is the system specific value for file and storage sizes.
ja: 省略時の設定はfileです、それはファイルとストレージのサイズに対するシステム規定値です。

source: The default strategy is the base64 strategy.
ja: 省略時の戦略は、base64戦略です。

source: The default strategy is the deferred To Date strategy.
ja: 省略時の戦略は、deferred To Date戦略です。

source: The default strategy is the throw strategy.
ja: 省略時の戦略は、throw戦略です。

source: The default value is .forward, which means later in time.
ja: 省略時の値は.forwardです、それは時間的により最近を意味します。

source: The default value is .forward.
ja: 省略時の値は、.forwardです。

source: The default value is NSFormatting Context Unknown.
ja: 省略時の値は、NSFormatting Context Unknownです。

source: The default value is false.
ja: 省略時の値は、falseです。

source: The default value is true.
ja: 省略時の値は、trueです。

source: The default value is 0.
ja: 省略時の値は、0です。

source: The default value is nil, indicating no tooltip is available.
ja: 省略時の値は、nilです、ツールチップが利用可能でないのを指し示します。

source: The default value is Int .max.
ja: 省略時の値は、Int .maxです。

source: The default value is an empty string ("").
ja: 省略時の値は、空文字列（""）です。

source: The default value of this property is default.
ja: このプロパティの省略時の値はdefaultです。

source: The default value of this property is none.
ja: このプロパティの省略時の値はnoneです。

source: The default value of this property is positional.
ja: このプロパティの省略時の値はpositionalです。

source: The default value of this property is 0, which does not cause the elimination of any units.
ja: このプロパティの省略時の値は0、それはどんな単位の排除も引き起こしません。

source: The default value of this property is false.
ja: このプロパティの省略時の値はfalseです。

source: The default value of this property is nil.
ja: このプロパティの省略時の値はnilです。

source: The default value of this property is the calendar associated with the current locale object.
ja: このプロパティの省略時の値は、現在のlocaleオブジェクトと関連付けられたカレンダーです。

source: The default value of this property is the calendar returned by the autoupdating Current method of NSCalendar.
ja: このプロパティの省略時の値は、NSCalendarのautoupdating Currentメソッドによって返されるカレンダーです。

source: The default value of this property is the current user’s locale, which is accessible from the current method of NSLocale.
ja: このプロパティの省略時の値は、現在のユーザのロケールです、それはcurrent method of NSLocaleからアクセス可能です。

source: The default value of this property is the default time zone for the current user, which is accessible from the default method of NSTime Zone.
ja: このプロパティの省略時の値は、省略時のタイムゾーンです、それはNSTime Zoneのdefaultメソッドからアクセス可能です。

source: The default values for newly created directories are as follows:
ja: 新しく作成されるディレクトリに対する省略時の値は以下になります：

source: The default values for newly created files are as follows:
ja: 新しく作成されるファイルに対する省略時の値は、次のとおりです：

source: The default version is 0.
ja: 省略時のバージョンは0です。

source: The delegate of the file manager object.
ja: ファイルマネージャオブジェクトの委任先。

source: The delegate’s role is to affirm the operation and to decide whether to proceed when errors occur.
ja: 委任先の持つ役割は、操作を肯定すること、そしてエラーが発生した場合に続けるかどうかを決めることです。

source: The descriptor from the specified position (one-based) in the descriptor list, or nil if the specified descriptor cannot be obtained.
ja: 記述子リストの中の指定された位置（１起点）からの記述子、または指定された記述子が入手されることが出来ないならばnil。

source: The descriptor to add to the receiver.
ja: レシーバに加えられる記述子。

source: The descriptor to insert in the receiver.
ja: レシーバの中に挿入される記述子。

source: The descriptor type of the receiver.
ja: レシーバの記述子型。

source: The descriptor type to be set in the initialized descriptor.
ja: 初期化される記述子の中に設定される記述子型。

source: The descriptor type to be set in the returned descriptor.
ja: 返される記述子の中に設定される記述子型。

source: The descriptor type to coerce the receiver to.
ja: レシーバをこれへと強制する記述子型。

source: The designated initializer for NSApple Event Descriptor is init(ae Desc No Copy:).
ja: NSApple Event Descriptorのための指定イニシャライザは、init(ae Desc No Copy:)です。

source: The details of a coordinated-read or coordinated-write operation.
ja: 協調読み込みまたは協調書き出し演算の詳細。

source: The development team ID that precedes each container ID string is the unique identifier associated with your development team.
ja: 開発チームIDで各コンテナID文字列に先立つものは、あなたの開発チームと結び付けられる固有識別子です。

source: The dictionary contains entries whose values are the file wrappers and whose keys are the unique filenames that have been assigned to each one.
ja: 辞書は、それの値がファイルラッパーである、そしてそれのキーが固有なファイル名である、各自割り当てられる、登録項目を含みます。

source: The dictionary key is a unique filename, which is the same as the passed-in file wrapper's preferred filename unless that name is already in use as a key in the directory's dictionary of children.
ja: 辞書キーは特有なファイル名です、それは中に渡されたファイルラッパーの持つ優先ファイル名と同じです、ディレクトリの持つ子らからなる辞書の中のあるキーとして、既にその名前が使用中でない限りは。

source: The dictionary key is a unique filename, which is the same as the passed-in file wrapper's preferred filename unless that name is already in use as a key in the directory’s dictionary of children.
ja: 辞書キーは特有なファイル名です、それは中に渡されたファイルラッパーの持つ優先ファイル名と同じです、ディレクトリの持つ子らからなる辞書の中のあるキーとして既にその名前が使用中でない限りは。

source: The dictionary key is a unique filename, which may not be the same as the passed-in file wrapper's preferred filename if more than one file wrapper in the directory's dictionary of children has the same preferred filename.
ja: 辞書キーは特有なファイル名です、それはファイルラッパーの持つ優先ファイル名と同じものではないかもしれません、もしディレクトリの持つ子らの辞書の中の複数のファイルラッパーが同じ優先名を持つならば。

source: The dictionary must contain entries whose values are the file wrappers that are to become children and whose keys are filenames.
ja: 辞書は、それの値が子らになる予定のファイルラッパーであり、それのキーがファイル名である登録項目を含まなければなりません。

source: The dictionary of header fields created from the provided cookies.
ja: 提供されたクッキーから作成されたヘッダフィールドからなる辞書。

source: The direction in time to search.
ja: 時間での検索する方向。

source: The directories are ordered according to the order of the domain mask constants, with items in the user domain first and items in the system domain last.
ja: これらディレクトリは、ユーザ領域の項目が最初でシステム領域の項目が最後となる、領域マスク定数の順番に従って順番付けられます。

source: The directory and the item are the same.
ja: このディレクトリと項目は同じです。

source: The directory contains the specified item.
ja: このディレクトリは、指定された項目を含みます。

source: The directory does not contain the item and is not the same as the item.
ja: ディレクトリは項目を含んでいません、そして項目と同じではありません。
